---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralAttachmentStartValueDistance
source: html/72cf1870-d3cd-35c7-e9e4-182c88c90c2e.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralAttachmentStartValueDistance Property

"Start Attachment Distance"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralAttachmentStartValueDistance { get; }
```